#3 1.	Вычислить число c заданной точностью d
# Пример:
# 	при $d = 0.001, π = 3.141.$ $10^{-1} ≤ d ≤10^{-10}$

# from math import pi
# d =  int(input("Введите число для заданной точности числа Пи (сколько знаком после запятой показать):\n"))
# print(f'число Пи с заданной точностью {d} равно {round(pi, d)}')


# 2.Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.


n = int(input('Введите число - '))
multipliers = []
for i in range(2, n+1):
    while n % i == 0:
        multipliers.append(i)
        n /= i
print(multipliers)